## Staging: quicksight
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**❌ &nbsp; Terraform Plan:** `failed`
**❌ &nbsp; Conftest:** `failed` 

<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform planned the following actions, but then encountered a problem:

  # aws_iam_policy.quicksight-s3-usage will be created
  + resource "aws_iam_policy" "quicksight-s3-usage" {
      + arn         = (known after apply)
      + description = "Allow access to S3"
      + id          = (known after apply)
      + name        = "s3-usage"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:GetObject",
                          + "s3:GetObjectVersion",
                          + "s3:ListBucket",
                          + "s3:ListBucketMultipartUploads",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_role_policy_attachment.s3-qs-attach will be created
  + resource "aws_iam_role_policy_attachment" "s3-qs-attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "quicksight"
    }

  # aws_quicksight_data_set.notifications will be updated in-place
  ~ resource "aws_quicksight_data_set" "notifications" {
        id             = "239043911459,notifications"
        name           = "Notifications"
        tags           = {}
        # (6 unchanged attributes hidden)

      - physical_table_map {
          - physical_table_map_id = "notifications" -> null

          - custom_sql {
              - data_source_arn = "arn:aws:quicksight:ca-central-1:239043911459:datasource/NotificationCanadaCastaging" -> null
              - name            = "notifications" -> null
              - sql_query       = <<-EOT
                    with notification_data as (
                                select 
                                  id as notification_id,
                                  created_at as notification_created_at,
                                  queue_name as notification_queue_name,
                                  sent_at as notification_sent_at,
                                  notification_status,
                                  notification_type,
                                  updated_at notification_updated_at,
                                  job_id,
                                  api_key_id,
                                  key_type as api_key_type,
                                  service_id,
                                  template_id
                                from notifications
                              union
                                select 
                                  id as notification_id,
                                  created_at as notification_created_at,
                                  queue_name as notification_queue_name,
                                  sent_at as notification_sent_at,
                                  notification_status,
                                  notification_type,
                                  updated_at notification_updated_at,
                                  job_id,
                                  api_key_id,
                                  key_type as api_key_type,
                                  service_id,
                                  template_id
                                from notification_history
                            ),
                            service_data as (
                              select
                                s.id as service_id,
                                s.active as service_active,
                                count_as_live as service_count_as_live,
                                s.go_live_at as service_go_live_at,
                                s.name as service_name,
                                s.message_limit as service_message_limit,
                                s.rate_limit as service_rate_limit,
                                s.sms_daily_limit as service_sms_daily_limit,
                                o.name as organisation_name,
                                s.organisation_id
                              from services s join organisation o on s.organisation_id = o.id
                            ),
                            template_data as (
                              select
                                id as template_id,
                                created_at as template_created_at,
                                name as template_name,
                                updated_at as template_updated_at,
                                version as template_version
                              from templates
                            )
                            select
                              notification_id, notification_created_at, notification_sent_at, notification_status,
                              notification_queue_name, notification_type, notification_updated_at, job_id, api_key_id, api_key_type,
                              s.*, t.*
                            from notification_data n 
                              join service_data s on n.service_id = s.service_id
                              join template_data t on n.template_id = t.template_id
                EOT -> null

              - columns {
                  - name = "notification_id" -> null
                  - type = "STRING" -> null
                }
              - columns {
                  - name = "notification_created_at" -> null
                  - type = "DATETIME" -> null
                }
              - columns {
                  - name = "notification_sent_at" -> null
                  - type = "DATETIME" -> null
                }
              - columns {
                  - name = "notification_updated_at" -> null
                  - type = "DATETIME" -> null
                }
              - columns {
                  - name = "notification_queue_name" -> null
                  - type = "STRING" -> null
                }
              - columns {
                  - name = "notification_status" -> null
                  - type = "STRING" -> null
                }
              - columns {
                  - name = "notification_type" -> null
                  - type = "STRING" -> null
                }
              - columns {
                  - name = "job_id" -> null
                  - type = "STRING" -> null
                }
              - columns {
                  - name = "api_key_id" -> null
                  - type = "STRING" -> null
                }
              - columns {
                  - name = "api_key_type" -> null
                  - type = "STRING" -> null
                }
              - columns {
                  - name = "service_id" -> null
                  - type = "STRING" -> null
                }
              - columns {
                  - name = "service_active" -> null
                  - type = "BIT" -> null
                }
              - columns {
                  - name = "service_count_as_live" -> null
                  - type = "BIT" -> null
                }
              - columns {
                  - name = "service_go_live_at" -> null
                  - type = "DATETIME" -> null
                }
              - columns {
                  - name = "service_name" -> null
                  - type = "STRING" -> null
                }
              - columns {
                  - name = "service_message_limit" -> null
                  - type = "INTEGER" -> null
                }
              - columns {
                  - name = "service_rate_limit" -> null
                  - type = "INTEGER" -> null
                }
              - columns {
                  - name = "service_sms_daily_limit" -> null
                  - type = "INTEGER" -> null
                }
              - columns {
                  - name = "organisation_name" -> null
                  - type = "STRING" -> null
                }
              - columns {
                  - name = "organisation_id" -> null
                  - type = "STRING" -> null
                }
              - columns {
                  - name = "template_id" -> null
                  - type = "STRING" -> null
                }
              - columns {
                  - name = "template_created_at" -> null
                  - type = "DATETIME" -> null
                }
              - columns {
                  - name = "template_name" -> null
                  - type = "STRING" -> null
                }
              - columns {
                  - name = "template_updated_at" -> null
                  - type = "DATETIME" -> null
                }
              - columns {
                  - name = "template_version" -> null
                  - type = "INTEGER" -> null
                }
            }
        }
      + physical_table_map {
          + physical_table_map_id = "notifications"

          + custom_sql {
              + data_source_arn = "arn:aws:quicksight:ca-central-1:239043911459:datasource/NotificationCanadaCastaging"
              + name            = "notifications"
              + sql_query       = <<-EOT
                    with notification_data as (
                                select 
                                  id as notification_id,
                                  created_at as notification_created_at,
                                  queue_name as notification_queue_name,
                                  sent_at as notification_sent_at,
                                  notification_status,
                                  notification_type,
                                  updated_at notification_updated_at,
                                  job_id,
                                  api_key_id,
                                  key_type as api_key_type,
                                  service_id,
                                  template_id,
                                  reference as notification_reference
                                from notifications
                              union
                                select 
                                  id as notification_id,
                                  created_at as notification_created_at,
                                  queue_name as notification_queue_name,
                                  sent_at as notification_sent_at,
                                  notification_status,
                                  notification_type,
                                  updated_at notification_updated_at,
                                  job_id,
                                  api_key_id,
                                  key_type as api_key_type,
                                  service_id,
                                  template_id,
                                  reference as notification_reference
                                from notification_history
                            ),
                            service_data as (
                              select
                                s.id as service_id,
                                s.active as service_active,
                                count_as_live as service_count_as_live,
                                s.go_live_at as service_go_live_at,
                                s.name as service_name,
                                s.message_limit as service_message_limit,
                                s.rate_limit as service_rate_limit,
                                s.sms_daily_limit as service_sms_daily_limit,
                                o.name as organisation_name,
                                s.organisation_id
                              from services s join organisation o on s.organisation_id = o.id
                            ),
                            template_data as (
                              select
                                id as template_id,
                                created_at as template_created_at,
                                name as template_name,
                                updated_at as template_updated_at,
                                version as template_version
                              from templates
                            )
                            select
                              notification_id, notification_created_at, notification_sent_at, notification_status,
                              notification_queue_name, notification_type, notification_updated_at, 
                              notification_reference, job_id, api_key_id, api_key_type,
                              s.*, t.*
                            from notification_data n 
                              join service_data s on n.service_id = s.service_id
                              join template_data t on n.template_id = t.template_id
                EOT

              + columns {
                  + name = "notification_id"
                  + type = "STRING"
                }
              + columns {
                  + name = "notification_created_at"
                  + type = "DATETIME"
                }
              + columns {
                  + name = "notification_sent_at"
                  + type = "DATETIME"
                }
              + columns {
                  + name = "notification_updated_at"
                  + type = "DATETIME"
                }
              + columns {
                  + name = "notification_queue_name"
                  + type = "STRING"
                }
              + columns {
                  + name = "notification_status"
                  + type = "STRING"
                }
              + columns {
                  + name = "notification_type"
                  + type = "STRING"
                }
              + columns {
                  + name = "notification_resource"
                  + type = "STRING"
                }
              + columns {
                  + name = "job_id"
                  + type = "STRING"
                }
              + columns {
                  + name = "api_key_id"
                  + type = "STRING"
                }
              + columns {
                  + name = "api_key_type"
                  + type = "STRING"
                }
              + columns {
                  + name = "service_id"
                  + type = "STRING"
                }
              + columns {
                  + name = "service_active"
                  + type = "BIT"
                }
              + columns {
                  + name = "service_count_as_live"
                  + type = "BIT"
                }
              + columns {
                  + name = "service_go_live_at"
                  + type = "DATETIME"
                }
              + columns {
                  + name = "service_name"
                  + type = "STRING"
                }
              + columns {
                  + name = "service_message_limit"
                  + type = "INTEGER"
                }
              + columns {
                  + name = "service_rate_limit"
                  + type = "INTEGER"
                }
              + columns {
                  + name = "service_sms_daily_limit"
                  + type = "INTEGER"
                }
              + columns {
                  + name = "organisation_name"
                  + type = "STRING"
                }
              + columns {
                  + name = "organisation_id"
                  + type = "STRING"
                }
              + columns {
                  + name = "template_id"
                  + type = "STRING"
                }
              + columns {
                  + name = "template_created_at"
                  + type = "DATETIME"
                }
              + columns {
                  + name = "template_name"
                  + type = "STRING"
                }
              + columns {
                  + name = "template_updated_at"
                  + type = "DATETIME"
                }
              + columns {
                  + name = "template_version"
                  + type = "INTEGER"
                }
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 2 to add, 1 to change, 0 to destroy.

Error: bucket must not be empty, got 

  with aws_s3_object.manifest_file,
  on data_source.tf line 38, in resource "aws_s3_object" "manifest_file":
  38:   bucket = var.s3_bucket_sms_usage_id

time=2024-03-07T16:16:17Z level=error msg=Terraform invocation failed in /home/runner/work/notification-terraform/notification-terraform/env/staging/quicksight/.terragrunt-cache/2hw_oXfQuoNLcJYlpM2oTZqPdpY/ziUKr5pa_JoeDZ3wgSbieuIpHJE/quicksight prefix=[/home/runner/work/notification-terraform/notification-terraform/env/staging/quicksight] 
time=2024-03-07T16:16:17Z level=error msg=1 error occurred:
	* exit status 1



```

</details>

